CanFlipWorkPlane Property
 Identifies if the instance can flip its work plane.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool CanFlipWorkPlane { get; }
  Visual Basic
Public ReadOnly Property CanFlipWorkPlane As Boolean
	Get
  Visual C++
public:
property bool CanFlipWorkPlane {
	bool get ();
}
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →